# Задание 4
# Создайте две символьных переменных а и b. Занесите в них слова "Вторник" и "Понедельник". 
# Выведите слова так, чтобы понедельник шёл перед вторником и между ними находилась запятая с пробелом (", ")

if __name__ == '__main__':
    a = "Понедельник"
    b = "Вторник"
    print(a,b, sep=', ')
