# Задание 1
# Напишите функцию, которая принимает параметр – натуральное число N и выводит на экран линию из N символов '–'.



if __name__ == '__main__':
    n = int(input("Введите N: "))
    print('-' * n)